{
  "extName": {
    "message": "Инструменты для ҵихиттух",
    "description": "Name of the extension"
  },
  "extDescription": {
    "message": "Инструменты для конланга ҵихиттух, например: словарь с поиском, правила языка, настраиваемый рендер текста с уникальными шрифтами.",
    "description": "Description of the extension"
  },
  "searchPlaceholder": {
    "message": "Искать в словаре...",
    "description": "Placeholder in the search field of the dictionary"
  },
  "searchButton": {
    "message": "Поиск",
    "description": "Caption on the search button"
  },
  "rulesButton": {
    "message": "Открыть правила языка",
    "description": "Caption on the button which allows to view rules of the language"
  },
  "browseButton": {
    "message": "Просмотреть статьи функторов",
    "description": "Caption on the button which allows to browse word entries manually"
  },
  "drawingButton": {
    "message": "Показать меню рисования",
    "description": "Caption on the button which shows drawing settings"
  },
  "fieldStatusReady": {
    "message": "Готово!",
    "description": "Caption on the status field, showing that the extension is ready"
  },
  "fieldStatusBusy": {
    "message": "Занято...",
    "description": "Caption on the status field, showing that the extension is busy doing something"
  },
  "parentPredicate": {
    "message": "Родительский предикат:",
    "description": "Caption shown before parent predicate in word entry"
  },
  "drawingHelp1": {
    "message": "Пример того, как нужно вводить текст, который нужно нарисовать:",
    "description": "First row of help showing on the custom drawing screen"
  },
  "drawingHelp2": {
    "message": "''фисуст кут фукх тхи фҵсуифсҵхус хут'' становится",
    "description": "Second row of help showing on the custom drawing screen"
  },
  "drawingHelp3": {
    "message": "''fis ust kut fu kh thi f! su if s! hus hut''",
    "description": "Third row of help showing on the custom drawing screen"
  },
  "drawButton": {
    "message": "Отрисовать",
    "description": "Caption on the button which triggers the custom drawing"
  },
  "drawTextPlaceholder": {
    "message": "Текст для отрисовки",
    "description": "Placeholder in the input field for custom text drawing"
  },
  "languageRules1": {
    "message": "Ҵ, ҵ соответствуют звуку дентального щелчка. Сочетания звуков \"тс\" произносятся раздельно как \"т\" и \"с\", идущие подряд два и более одинаковых звука также произносятся раздельно каждый.",
    "description": "A row of language rules (1)"
  },
  "languageRules2": {
    "message": "Предикат – некоторое утверждение, обычно имеющее структуру вида \"функтор(аргументы){условие}\". \"(\", \")\", \"{\", \"}\" на письме и в речи передаются специальными служебными словами-частицами. Аргументы и/или условие могут быть опущены, если в них нет необходимости – тогда вместе с ними опускаются и соответствующие частицы начала и конца, – и также являются наборами предикатов. Единственный обязательный элемент предиката – функтор, само слово.",
    "description": "A row of language rules (2)"
  },
  "languageRules3": {
    "message": "Аргументы, или список аргументов могут состоять из одного или нескольких объектов и субъектов, то есть того, над чем совершается действие, и того, что именно совершает действие, или к чему относится понятие, выражаемое функтором. Возможные структуры списка аргументов приведены ниже; функтор и условие опущены:",
    "description": "A row of language rules (3)"
  },
  "languageRules4": {
    "message": "субъект ∧ объект",
    "description": "A row of language rules (4)"
  },
  "languageRules5": {
    "message": "субъект ∧ объект | объект | ...",
    "description": "A row of language rules (5)"
  },
  "languageRules6": {
    "message": "субъект ∧ [список субъектов]",
    "description": "A row of language rules (6)"
  },
  "languageRules7": {
    "message": "объект",
    "description": "A row of language rules (7)"
  },
  "languageRules8": {
    "message": "[список объектов]",
    "description": "A row of language rules (8)"
  },
  "languageRules9": {
    "message": "субъект ∧ []",
    "description": "A row of language rules (9)"
  },
  "languageRules10": {
    "message": "[список субъектов], []",
    "description": "A row of language rules (10)"
  },
  "languageRules11": {
    "message": "В примерах выше символом \"∧\" обозначен логический оператор \"И\", символом \"|\" –место для любого из логических операторов, символами \"[\" и \"]\" – начало и конец списка (о списках будет рассказано далее). Как видно, субъект(ы) является свободно опускаемым элементом предиката, в то время как вместо опускаемого объект(ов) необходимо использовать пустой список. Но существуют и предикаты-исключения, у которых эти структуры могут отличаться: иметь свободно опускаемый объект, обязательное условие и т.д. В речи и письме все частицы, закрывающие любые списки/условия, идущие подряд в конце всего выражения, также могут быть свободно опущены.",
    "description": "A row of language rules (11)"
  },
  "languageRules12": {
    "message": "Предикат считается истинным, если истинным является выражение, составляющее его условие – один или несколько предикатов, соединённых логическими операторами. Условие также может быть прикреплено к списку.",
    "description": "A row of language rules (12)"
  },
  "languageRules13": {
    "message": "Список – один, несколько или ни одного предиката, заключённые в специальные служебные слова-частицы. Предикаты внутри списка могут соединяться логическими операторами, но могут также и идти в нём подряд, без операторов; в таких случаях значение списка устанавливается, как если бы в нём между предикатами находились логические операторы \"И\". Также, если в предикате стоят подряд несколько частиц, закрывающих список аргумента или условие, можно сократить запись конструкцией вида \"[)]\" или \"[}]\". Границы двух и более обычных списков, списков аргументов и/или условий не могут пересекаться, то есть конец одного списка не может находиться внутри другого и т.п. О других способах применения списков можно прочесть ниже в соответствующих разделах.",
    "description": "A row of language rules (13)"
  },
  "languageRules14": {
    "message": "Каждый функтор состоит из корния и артикля. Корень состоит из слогов, которые, в свою очередь, состоят из 2 либо 3 звуков. Все артикли постпозитивны, пишутся слитно с самим функтором в его конце и взаимоисключаемы. Возможные артикли:",
    "description": "A row of language rules (14)"
  },
  "languageRules15": {
    "message": "Нулевой артикль. Используется для указания на то, что имеется в виду непосредственно комбинация звуков, а не стоящие за ней понятия. На письме и в речи никак не обозначается. Также используется у чисел.",
    "description": "A row of language rules (15)"
  },
  "languageRules16": {
    "message": "Неопределённый артикль. Используется, когда предикат обозначает любую сущность или множество сущностей, соответствующее смыслу функтора. На протяжении контекста выражения это могут быть разные сущности/множества. Поэтому же используется и для выражения множественного числа.",
    "description": "A row of language rules (16)"
  },
  "languageRules17": {
    "message": "Определённый артикль. Используется, когда предикат указывает на одну конкретную сущность. Создаёт собственный контекст на протяжении выражения; но есть и особые предикаты, создающие собственные контексты, независимые от других таких же предикатов с тем же артиклем в рамках одного выражения (например, указание на другую сущность).",
    "description": "A row of language rules (17)"
  },
  "languageRules18": {
    "message": "Артикль частичного количества. Используется, когда предикат указывает на часть (долю множества) сущности или множества сущностей, обозначаемых данным функтором. На протяжении контекста подразумеваемые доли могут различаться. Если речь идёт о части или доле, обладающей определённым признаком, то этот артикль добавляется к функтору, который выражает то, о части чего говорится; а указательный предикат, несущий смысл признака, вводится в качестве аргумента родительского предиката и указывается первым, перед всеми остальными аргументами, если они есть.",
    "description": "A row of language rules (18)"
  },
  "languageRules19": {
    "message": "Артикль частичности. Используется, когда предикат указывает на часть (долю самой сущности) любой из множества сущностей, обозначаемых данным функтором. Если речь идёт о какой-то конкретной части или доле, то используются конструкции, аналогичные используемым с артиклем частичного количества.",
    "description": "A row of language rules (19)"
  },
  "languageRules20": {
    "message": "Существует четыре логические оператора: \"И\", \"ИЛИ\", \"Исключающее ИЛИ\", \"НЕ\". Оператор \"НЕ\" ставится перед началом функтора предиката, к которому относится; остальные ставятся между двумя предикатами, к которым относятся, то есть после конца условия первого предиката и перед началом функтора второго.",
    "description": "A row of language rules (20)"
  },
  "languageRules21": {
    "message": "Предикаты, являющиеся аналогом вопросов, образуются из обычных предикатов, но на том месте, где стоял бы предикат, являющийся предметом вопроса, ставится \"кутс\", предикат неопределённости с артиклем собственных имён.",
    "description": "A row of language rules (21)"
  },
  "languageRules22": {
    "message": "Если возникает необходимость использовать несколько вложенных друг в друга предикатов, не имеющих субъекта, и это совершенно точно не является ошибкой и правильным использованием языка, то используется предикат, функтором которого является \"хситс\" – предикат вложенности с артиклем собственных имён, – а аргументами являются предикаты, которые должны были быть вложены, в порядке увеличения степени вложенности. У такого предиката весь список аргументов является списком объектов, поэтому записывается по правилам обычного списка; но частицы, обозначающие начало и конец списка, могут быть при этом опущены.",
    "description": "A row of language rules (22)"
  },
  "languageRules23": {
    "message": "Используется симметричная троичная система счисления, то есть имеющие цифры ноль, положительную единицу и отрицательную единицу. Числа записываются и произносятся, начиная с младшего разряда. Самый старший разряд числа обозначает знак. Если выражение не является целиком математическим, и внутри него присутствует число или вложенное математическое выражение, то такое число/вложенное выражение может быть заключено в простой список, хотя для простых чисел это часто бывает излишне. В рамках математических выражений в качестве операторов и иных смысловых компонентов используются обычные предикаты с нулевым артиклем, приобретающие при этом новые оттенки смыслов.",
    "description": "A row of language rules (23)"
  },
  "languageRules24": {
    "message": "Операция вычитания в отдельном виде не используется; вместо этого при работе с явно заданными числами используется операция сложения с числом, имеющим инвертированный старший разряд. При работе с неизвестными или хранилищами значений для вычитания используется сложение с операндом, умноженным на отрицательную единицу. Вместо извлечения корня используется возведение в дробную степень. Для обозначения неизвестных чисел используются так называемые хранилища, записываемые как число, начинающееся с функтора неопределённости \"ку\".",
    "description": "A row of language rules (24)"
  },
  "languageRules25": {
    "message": "Если в рамках обычного выражения нужно сказать, что некоторая сущности присутствует в определённом количестве, то предикат сущности используется с артиклем частичного количества, а первым уточняющим аргументом становится необходимое число. Частный случай в виде указания на то, что сущность есть исключительно в единственном экземпляре, может также быть выражен через использование артикля собственных имён для функтора сущности. Если в рамках обычного выражения нужно указать некоторый диапазон вида \"от * до *\", то указываются два числа с логическим оператором \"И\".",
    "description": "A row of language rules (25)"
  },
  "languageRules26": {
    "message": "Новые функторы образуются из предикатов, у которых были опущены все частицы, а у составляющих их функторов – опущены артикли. По такому же принципу образуются и функторы предикатов фразеологизмов.",
    "description": "A row of language rules (26)"
  },
  "languageRules27": {
    "message": "Все функторы, относящиеся к цветам, имеют в своём составе слог от функтора со значением \"свет\", и делятся на две группы. Старшие цвета приблизительно соответствуют цветам звёзд различных спектральных классов, и их соответствия функторам достаточно жёстки, а равно и порядок, в котором эти цвета идут. Младшие цвета – все прочие, и соответствия редко устаиваются; для надёжности они нередко уточняются непосредственно в ходе речи/письма.",
    "description": "A row of language rules (27)"
  },
  "languageRules28": {
    "message": "Названия направлений в пространстве трёхсоставны и буквально означают \"к вратам цвета *\" или \"от врат цвета *\". Девять старших цветов покрывают девять координатных осей, поэтому стандартными средствами языка можно выражать до восемнадцати направлений девятимерного пространства. Для больших мерностей обозначения уже строятся с использованием названий младших цветов и заранее оговариваются, подобно самим младшим цветам. Для трёхмерного пространства соответствия осям идут в порядке: север-юг, запад-восток, верх-низ.",
    "description": "A row of language rules (28)"
  },
  "languageRules29": {
    "message": "Есть различные способы письма. Для двухмерной записи наиболее распространены два: фҵтиспиҵк, или стандартный, и уҵусихтфҵ, или символьный. В стандартном стиле каждый слог изображается комбинацией из черт и/или точек, соответствущим звукам, составляющим слог. Символьный стиль является стилизованным и претерпевшим некоторые изменения рукописным стилем, образованным от стандартного. Трёхмерное письмо записывается последовательностью точек с исходящими из них шестью взаимно перпендикулярными лучами, изображающими те же черты и/или точки, что и в стандартном двухмерном стиле – изначально последний появился как проекция на двухмерную плоскость трёхмерного стиля. В любом случае символы звуков и/или слогов записываются сначала снизу вверх, затем справа налево.",
    "description": "A row of language rules (29)"
  }
}
